study_buddy_api_rails/app/controllers/concepts_controller.rb

  def update
    if @concept.update(concept_params)
---
UPDATE "concepts" SET "name" = $1, "category" = $2, "updated_at" = $3 WHERE "concepts"."id" = $4  [["name", ""], ["category", ""], ["updated_at", "2020-08-06 15:57:55.821674"], ["id", 2]]

    def set_concept
      @concept = Concept.find(params[:id])
---
SELECT "concepts".* FROM "concepts" WHERE "concepts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]