study_buddy_api_rails/app/controllers/interviews_controller.rb

INSERT INTO "interviews" ("interview_type", "company_name", "interview_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @interview = Interview.new(interview_params)

    if @interview.save

DELETE FROM "interviews" WHERE "interviews"."id" = $1  [["id", 2]]
---
  def destroy
    @interview.destroy

SELECT "interviews".* FROM "interviews" WHERE "interviews"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_interview
      @interview = Interview.find(params[:id])