study_buddy_api_rails/app/controllers/registrations_controller.rb

INSERT INTO "users" ("username", "name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        user = User.create!(
            username: params['user']['username'],
            name: params['user']['name'],
            email: params['user']['email'],
            password: params['user']['password'],
            password_confirmation: params['user']['password_confirmation'],
            study_availability: params['user']['study_availability']
        )